import CifraDisplay from "@/components/cifra-display";
import FloatingMenu from "@/components/floating-menu";

const cifra = `Alceu Valença - Anunciação

[Intro] G  Am  C  
        G  Am  C  G

[Dedilhado - Intro]

Parte 1 De 5
   G
E|------------------------------------------|
B|-3-------3-------3------------------------|
G|-0-------0-------0------------------------|
D|-0-------0-------0------------------------|
A|------------------------------------------|
E|---3-3-----3-3-----3-3--------------------|

Parte 2 De 5
E|-3-5-7-7/8-7-5-------5---5----------------|
B|---------------8-5-8---8------------------|
G|-------0----------------------------------|
D|------------------------------------------|
A|------------------------------------------|
E|------------------------------------------|

Parte 3 De 5
   Am
E|------------------5-7-8-7-5---------------|
B|-5-------5------8-----------8-------------|
G|-5-------5--------------------------------|
D|-7-------7--------------------------------|
A|---0-0-----0-0----0-0-----0-0-------------|
E|------------------------------------------|

Parte 4 De 5
               G
E|-0-7-5-3-3--------------------------------|
B|-------------3-------3--------------------|
G|-----0-------0-------0--------------------|
D|-------------0-------0--------------------|
A|-----3------------------------------------|
E|---------------3-3-----3-3----------------|

Parte 2 De 5
E|-3-5-7-7/8-7-5-------5---5----------------|
B|---------------8-5-8---8------------------|
G|-------0----------------------------------|
D|------------------------------------------|
A|------------------------------------------|
E|------------------------------------------|

Parte 3 De 5
   Am
E|------------------5-7-8-7-5---------------|
B|-5-------5------8-----------8-------------|
G|-5-------5--------------------------------|
D|-7-------7--------------------------------|
A|---0-0-----0-0----0-0-----0-0-------------|
E|------------------------------------------|

Parte 5 De 5
               G
E|-0-7-5-3-3--------------------------------|
B|-------------3-------3-------3------------|
G|-----0-------0-------0-------0------------|
D|-------------0-------0-------0------------|
A|-----3------------------------------------|
E|---------------3-3-----3-3-----3-3--------|

[Primeira Parte] 

[Dedilhado - Primeira Parte]

Parte 1 De 3
   Am
E|-------5----------------------------------|
B|-----5-5----------------------------------|
G|---5-5-----5---5--------------------------| (4x)
D|-----7-------7----------------------------|
A|------------------------------------------|
E|-5-------5--------------------------------|

Parte 2 De 3
   C
E|-------0----------------------------------|
B|-----1-1----------------------------------|
G|---0-0-----0---0--------------------------|
D|-----2-------0----------------------------|
A|-3-------3--------------------------------|
E|------------------------------------------|

Parte 3 De 3
   G
E|-------3----------------------------------|
B|-----3-3----------------------------------|
G|---0-0-----0---0--------------------------| (5x)
D|-----0-------0----------------------------|
A|------------------------------------------|
E|-3-------3--------------------------------|
                       
Na bruma leve das paixões
            Am
Que vêm de dentro
                          C
Tu vens chegando pra brincar
            G
No meu quintal

No teu cavalo, peito nu
           Am
Cabelo ao vento
                         C             
E o Sol quarando nossas roupas
      G
No varal


Na bruma leve das paixões
            Am
Que vêm de dentro
                          C
Tu vens chegando pra brincar
            G
No meu quintal

No teu cavalo, peito nu
           Am
Cabelo ao vento
                         C             
E o Sol quarando nossas roupas
      G
No varal

[Refrão] 

[Dedilhado - Refrão]

Parte 1 De 4
   G
E|-------3----------------------------------|
B|-----3-3----------------------------------|
G|---0-0-----0---0--------------------------| (2x)
D|-----0-------0----------------------------|
A|------------------------------------------|
E|-3-------3--------------------------------|
       ↓

Parte 2 De 4
   Em
E|-------0----------------------------------|
B|-----0-0----------------------------------|
G|---0-0-----0---0--------------------------| (2x)
D|-----2-------2----------------------------|
A|------------------------------------------|
E|-0-------0--------------------------------|
       ↓

Parte 3 De 4
   F
E|-------1----------------------------------|
B|-----1-1----------------------------------|
G|---2-2-----2---2--------------------------|
D|-----3-------3----------------------------|
A|------------------------------------------|
E|-1-------1--------------------------------|

Parte 4 De 4
   C
E|-------0----------------------------------|
B|-----1-1----------------------------------|
G|---0-0-----0---0--------------------------|
D|-----2-------0----------------------------|
A|-3-------3--------------------------------|
E|------------------------------------------|
       ↓

Parte 1 De 4 
   G
E|-------3----------------------------------|
B|-----3-3----------------------------------|
G|---0-0-----0---0--------------------------| (2x)
D|-----0-------0----------------------------|
A|------------------------------------------|
E|-3-------3--------------------------------|
       ↓

    G        Em
Tu vens, tu vens
F          C              G
  Eu já escuto os teus sinais
             Em
Tu vens, tu vens
F          C              G
  Eu já escuto os teus sinais

[Segunda Parte] 

         (pausa)                  Am
A voz do anjo sussurrou no meu ouvido
                    C
Eu não duvido já escuto
           G
Os teus sinais
                               Am
Que tu virias numa manhã de domingo
                     C            G 
Eu te anuncio nos sinos das catedrais

[Refrão] 

    G        Em
Tu vens, tu vens
F          C              G
  Eu já escuto os teus sinais
             Em
Tu vens, tu vens
F          C              G
  Eu já escuto os teus sinais

( Am  C  G ) 
( Am  C  G )

[Primeira Parte] 
          
Na bruma leve das paixões
            Am
Que vêm de dentro
                          C
Tu vens chegando pra brincar
            G
No meu quintal

No teu cavalo, peito nu
           Am
Cabelo ao vento
                         C             
E o Sol quarando nossas roupas
      G
No varal

[Refrão] 

    G        Em
Tu vens, tu vens
F          C              G
  Eu já escuto os teus sinais
             Em
Tu vens, tu vens
F          C              G
  Eu já escuto os teus sinais

[Segunda Parte] 

                                  Am
A voz do anjo sussurrou no meu ouvido
                    C
Eu não duvido já escuto
           G
Os teus sinais
                               Am
Que tu virias numa manhã de domingo
                     C            G 
Eu te anuncio nos sinos das catedrais

[Refrão] 

    G        Em
Tu vens, tu vens
F          C              G
  Eu já escuto os teus sinais
             Em
Tu vens, tu vens
F          C              G
  Eu já escuto os teus sinais

[Final] Am  C  G  
        Am  C  G
        Am  C  G  
        Am  C  G

----------------- Acordes -----------------
Am = X 0 2 2 1 0
C = X 3 2 0 1 0
Em = 0 2 2 0 0 0
F = 1 3 3 2 1 1
G = 3 2 0 0 3 3
`;

const [title, ...restOfCifra] = cifra.split("\n\n");
const chordsSectionIndex = restOfCifra.findIndex((line) =>
  line.includes("----------------- Acordes -----------------")
);
const mainCifra = restOfCifra.slice(0, chordsSectionIndex).join("\n\n");
const chords = restOfCifra.slice(chordsSectionIndex).join("\n\n");

export default function AnunciacaoPage() {
  return (
    <>
      <CifraDisplay
        title={title || ""}
        mainCifra={mainCifra || ""}
        chords={chords || ""}
      />
      <FloatingMenu />
    </>
  );
}
