import CifraDisplay from "@/components/cifra-display";
import FloatingMenu from "@/components/floating-menu";
import FramerTransitionWrapper from "@/components/framer-transition-wrapper";

const cifra = `Trio Parada Dura - Telefone Mudo

[Intro] A  G/B  A/C#
        D  A  E  A
        D  A  E  A


[TAB INTRO]
Parte 1 de 4

E|-2h4-5-5-5-5-5-4-5-5-5-5-4-4-0-----------------------
B|-----7-7-7-7-7-5-7-7-7-7-5-5-1--2--------------------
G|--------------------------------2--------------------
D|-----------------------------------------------------
A|-----------------------------------------------------
E|-----------------------------------------------------


Parte 2 de 4

E|---------0---0---------------------------------------
B|-2h3h4-----------3---2---2---0--2--------------------
G|-------1---1-----------------------------------------
D|---------------4---2---2---0----2--------------------
A|-----------------------------------------------------
E|-----------------------------------------------------


Parte 3 de 4

E|-2/4-5-5-5-5-5-4-5-5-4-7-5---2-0---------------------
B|-3/5-7-7-7-7-7-5-7-7-5-9-7---3-1---------------------
G|-----------------------------------------------------
D|-----------------------------------------------------
A|-----------------------------------------------------
E|-----------------------------------------------------


Parte 4 de 4

E|-----0-0-0-0-----------------------0--5--------------
B|-2h3---------3-3-2-2-5-3-0-2----2--------------------
G|-2h4-1-1-1-1-----------------2-----1--6--------------
D|-------------4-4-2-2-6-4-0-2----2--------------------
A|-----------------------------4-----------------------
E|-----------------------------------------------------

[Primeira Parte]

     D
Eu quero que risque
                    A
O meu nome da sua agenda
    E              D
Esqueça o meu telefone
           A
Não me ligue mais
     D
Porque já estou cansado
            A
De ser o remédio
                 E
Pra curar o seu tédio
                              A
Quando seus amores não lhe satisfaz

(E/G#  D6/F#)

[Refrão]

    E
Cansei de ser o seu palhaço
   D             A
Fazer o que sempre quis
                     E
Cansei de curar sua fossa
             D               A
Quando você não se sentia feliz

(E/G#  D6/F#)

    E
Por isso é que decidi
   D            A
O meu telefone cortar
                        E
Você vai discar várias vezes
          D        E    A
Telefone mudo não pode chamar

[Solo]  A  G/B  A/C#
        D  A  E  A
        D  A  E  A


[TAB INTRO]
Parte 1 de 4

E|-2h4-5-5-5-5-5-4-5-5-5-5-4-4-0-----------------------
B|-----7-7-7-7-7-5-7-7-7-7-5-5-1--2--------------------
G|--------------------------------2--------------------
D|-----------------------------------------------------
A|-----------------------------------------------------
E|-----------------------------------------------------


Parte 2 de 4

E|---------0---0---------------------------------------
B|-2h3h4-----------3---2---2---0--2--------------------
G|-------1---1-----------------------------------------
D|---------------4---2---2---0----2--------------------
A|-----------------------------------------------------
E|-----------------------------------------------------


Parte 3 de 4

E|-2/4-5-5-5-5-5-4-5-5-4-7-5---2-0---------------------
B|-3/5-7-7-7-7-7-5-7-7-5-9-7---3-1---------------------
G|-----------------------------------------------------
D|-----------------------------------------------------
A|-----------------------------------------------------
E|-----------------------------------------------------


Parte 4 de 4

E|-----0-0-0-0-----------------------0--5--------------
B|-2h3---------3-3-2-2-5-3-0-2----2--------------------
G|-2h4-1-1-1-1-----------------2-----1--6--------------
D|-------------4-4-2-2-6-4-0-2----2--------------------
A|-----------------------------4-----------------------
E|-----------------------------------------------------

[Primeira Parte]

     D
Eu quero que risque
                    A
O meu nome da sua agenda
    E              D
Esqueça o meu telefone
           A
Não me ligue mais
     D
Porque já estou cansado
            A
De ser o remédio
                 E
Pra curar o seu tédio
                              A
Quando seus amores não lhe satisfaz

(E/G#  D6/F#)

[Refrão]

    E
Cansei de ser o seu palhaço
   D             A
Fazer o que sempre quis
                     E
Cansei de curar sua fossa
             D               A
Quando você não se sentia feliz

(E/G#  D6/F#)

    E
Por isso é que decidi
   D            A
O meu telefone cortar
                        E
Você vai discar várias vezes
          D        E    A
Telefone mudo não pode chamar

[Solo final]

E  A  E  A


[TAB Solo final]
Parte 1 de 2

E|-------------------------7-7-------------------------
B|-2h3-5-5-5-5-7-5-9-9-9-9-9-9-5-5-5-9-7-3-2-----------
G|-2h4-6-6-6-6-7-6-9-9-9-9-----6-6-6-9-7-4-2-----------
D|-----------------------------------------------------
A|-----------------------------------------------------
E|-----------------------------------------------------


Parte 2 de 2

E|-----------------------------------------------------
B|-9/7-5/3-2-------------------------------------------
G|-9/7-6/4-2-------------------------------------------
D|-----------------------------------------------------
A|-----------------------------------------------------

E|| 
B|| 
G|| 
D|| 
A|| 

E|-----------------------------------------------------|


----------------- Acordes -----------------
A = X 0 2 2 2 0
A/C# = X 4 X 2 5 5
D = X X 0 2 3 2
D6/F# = 2 X 0 2 0 X
E = 0 2 2 1 0 0
E/G# = 4 X 2 4 5 X
G/B = X 2 0 0 3 3
`;

const [title, ...restOfCifra] = cifra.split("\n\n");
const chordsSectionIndex = restOfCifra.findIndex((line) =>
  line.includes("----------------- Acordes -----------------")
);
const mainCifra = restOfCifra.slice(0, chordsSectionIndex).join("\n\n");
const chords = restOfCifra.slice(chordsSectionIndex).join("\n\n");

export default function TelefoneMudoPage() {
  return (
    <>
      <FramerTransitionWrapper>
        <CifraDisplay
        title={title || ""}
        mainCifra={mainCifra || ""}
        chords={chords || ""}
      />
      </FramerTransitionWrapper>
      <FloatingMenu />
    </>
  );
}
