import CifraDisplay from "@/components/cifra-display";
import FloatingMenu from "@/components/floating-menu";
import FramerTransitionWrapper from "@/components/framer-transition-wrapper";

// URL: https://www.cifraclub.com.br/charlie-brown-jr/zoio-de-lula/

const cifra = `Charlie Brown Jr. - Zóio de Lula

[Intro] <b>Dm</b>  <b>D2</b>  <b>Dm</b>  <b>D2</b>
        <b>Dm</b>  <b>D2</b>  <b>Dm</b>  <b>D2</b> 
        <b>Dm</b>  <b>D2</b>  <b>Dm</b>  <b>D2</b> 
        <b>Dm</b>  <b>D2</b>  <b>Dm</b>  <b>D2</b> 

<span class="tablatura">[Tab - Intro]

<span class="cnt">E|-22...------10------------13-------------10---------|
B|------------10------------15--------10--------------|
G|------------10------------14------------------------|
D|----------------------------------------------------|
A|----------------------------------------------------|
E|----------------------------------------------------|</span></span>

[Primeira Parte]

<span class="tablatura">[Tab - Primeira Parte]

<span class="cnt">E|-10----------------------------------------10-------|
B|-10----------13---------13/15--15\13-------10-------|
G|-10----------12b---------------------------10-------|
D|------------------------10/12--12\10----------------|
A|----------------------------------------------------|
E|----------------------------------------------------|</span></span>

         <b>Dm</b>
Tirou a roupa
 
Entrou no mar
             <b>D2</b>
Pensei: Meu Deus
                  <b>Dm</b>
Que bom que fosse
                         <b>D2</b>
Tu me apresenta essa mulher
                           <b>Dm</b>
Meu irmão, te dava até um doce
              <b>D2</b>
Sem roupa ela é demais
           <b>Dm</b>
Também por isso

Eu creio em Deus
              <b>D2</b>
Meu bom, meu Deus

Meu bom, me traz
       <b>Dm</b>
Ainda bem que eu trouxe
          <b>D2</b>
Até meu guarda-sol
 <b>Dm</b>
Tenho toda tarde
 <b>D2</b>
Tenho a vida inteira
       <b>Dm</b>                    <b>D2</b>
Já se foi aquele tempo da ladeira, irmão
           <b>Dm</b>                    <b>D2</b>
Já que se foi aquele tempo da ladeira, irmão

[Segunda Parte]

<span class="tablatura">[Tab - Segunda Parte]

Parte 1 de 2
   <b>D2</b>                          <b>C2</b>
<span class="cnt">E|---------0---------0--------------------------------|
B|-3---3-----3---------3------------3-----------------|
G|-2-------------2---------2------------0-------------|
D|-0--------------------------------------------------|
A|-0---------------------------3-3--------------------|
E|----------------------------------------------------|</span></span>

<span class="tablatura">Parte 2 de 2
   <b>D2</b>                      <b>Dm</b>         <b>D4</b>
<span class="cnt">E|-----0---------0--------------------5---------------|
B|-3-----3---------3-----------6---8----8-------------|
G|-2---------2---------2---5h7-------------7----------|
D|-0--------------------------------------------------|
A|-0--------------------------------------------------|
E|----------------------------------------------------|</span></span>

          <b>D2</b>
Meu escritório é na praia

Eu tô sempre na área

Mas eu não sou
                 <b>C2</b>
Da tua láia, não
          <b>D2</b>
Meu escritório é na praia

Eu tô sempre na área
            <b>Dm</b>
Mas eu não sou
        <b>D4</b>
Daquela    láia, não

[Refrão]

<span class="tablatura">[Tab - Riff]

Parte 1 de 2
<span class="cnt">E|----------------------------------------------------|
B|----------------------------------------------------|
G|----------------------------------------------------|
D|-----0--0--0--2-3-2-----------0--0--0--2-3-2----5---|
A|-0-3----------------3--3--0-3----------------3------|
E|----------------------------------------------------|</span></span>

<span class="tablatura">Parte 2 de 2
<span class="cnt">E|----------------------------------------------------|
B|----------------------------------------------------|
G|----------------------------------------------------|
D|-----0--0--0--2-3-2-----------0--0--0--2-3-2----5---|
A|-0-3----------------3--3--0-3----------------3------|
E|----------------------------------------------------|</span></span>

Então
 <b>Dm</b>           <b>D2</b>
Deixe viver, deixe ficar
 <b>Dm</b>                 <b>D2</b>
Deixe estar como está
 <b>Dm</b>           <b>D2</b> 
Deixe viver, deixe ficar
 <b>Dm</b>                 <b>D2</b>
Deixe estar como está

[Terceira Parte]

Meu Deus, me dê um motivo
Pois eu pago tanto mico
Ela me ignora
Na esperança eu ainda fico
Eu tô fritando aqui
Vou entregar, não aguento mais
Mas se eu não falar hoje
Talvez nunca a veja mais

[Quarta Parte]

<span class="tablatura">[Tab - Quarta Parte]

<span class="cnt">E|-10---------15---------10---------15p13-------------|
B|-10---------15---------10---------15-----15---------|
G|-10---------15---------10---------14-----14---------|
D|----------------------------------------------------|
A|----------------------------------------------------|
E|----------------------------------------------------|</span></span>

O dia passa
Horas se estendem
As pessoas ao redor
Nunca me entendem
O dia passa
Horas se estendem
As pessoas ao redor
Nunca me entendem

[Refrão]

<span class="tablatura">[Tab - Riff]

Parte 1 de 2
<span class="cnt">E|----------------------------------------------------|
B|----------------------------------------------------|
G|----------------------------------------------------|
D|----------------------------------------------------|
A|-----0--0--0--2-3-2-----------0--0--0--2-3-2----5---|
E|-0-3----------------3--3--0-3----------------3------|
E|----------------------------------------------------|</span></span>

<span class="tablatura">Parte 2 de 2 
<span class="cnt">E|----------------------------------------------------|
B|----------------------------------------------------|
G|----------------------------------------------------|
D|-----0--0--0--2-3-2-----------0--0--0--2-3-2----5---|
A|-0-3----------------3--3--0-3----------------3------|
E|----------------------------------------------------|</span></span>

<span class="tablatura">Parte 1 de 2
<span class="cnt">E|----------------------------------------------------|
B|----------------------------------------------------|
G|----------------------------------------------------|
D|-----0--0--0--2-3-2-----------0--0--0--2-3-2----5---|
A|-0-3----------------3--3--0-3----------------3------|
E|----------------------------------------------------|</span></span>

<span class="tablatura">Parte 1 de 2
<span class="cnt">E|----------------------------------------------------|
B|----------------------------------------------------|
G|----------------------------------------------------|
D|-----0--0--0--2-3-2-----------0--0--0--2-3-2--------|
A|-0-3----------------3--3--0-3----------------3--3\--|
E|----------------------------------------------------|</span></span>

Então
 <b>Dm</b>           <b>D2</b>
Deixe viver, deixe ficar
 <b>Dm</b>                 <b>D2</b>
Deixe estar como está
 <b>Dm</b>           <b>D2</b> 
Deixe viver, deixe ficar
 <b>Dm</b>                 <b>D2</b>
Deixe estar como está

 <b>Dm</b>           <b>D2</b>
Deixe viver, deixe ficar
 <b>Dm</b>                 <b>D2</b>
Deixe estar como está
 <b>Dm</b>           <b>D2</b> 
Deixe viver, deixe ficar
 <b>Dm</b>                 <b>D2</b>
Deixe estar como está

[Solo]

<span class="tablatura">[Tab - Guitarra Solo]

Parte 1 de 4
<span class="cnt">E|---------10-----------------------------------------|
B|------------10-13b15-13b15~-------------------------|
G|-12b14----------------------------------------------|
D|----------------------------------------------------|
A|----------------------------------------------------|
E|----------------------------------------------------|</span></span>

<span class="tablatura">Parte 2 de 4
<span class="cnt">E|-12h13p12----12h13p12-------------------------------|
B|-----------------------13---------------------------|
G|---------------------------12--10--9----------------|
D|----------------------------------------------------|
A|----------------------------------------------------|
E|----------------------------------------------------|</span></span>

<span class="tablatura">Parte 3 de 4
<span class="cnt">E|------------8---------------------------------------|
B|-----8h9h10--------10h11p10--10h11p10---------------|
G|-10-------------------------------------------------|
D|----------------------------------------------------|
A|----------------------------------------------------|
E|----------------------------------------------------|</span></span>

<span class="tablatura">Parte 4 de 4
<span class="cnt">E|-/6p5p3---3-----------------------------5h8---------|
B|--------6---6-5p3-5h6p5p3-------------6-------------|
G|--------------------------5p3\2---5/7---------------|
D|--------------------------------3-------------------|
A|----------------------------------------------------|
E|----------------------------------------------------|</span></span>

<span class="tablatura">[Tab - Guitarra Base]

<span class="cnt">E|-10--------------------22...-----10--------15p13----|
B|-10-----------10---8-------------10--------15-------|
G|-10------10----------------------10--------14-------|
D|----------------------------------------------------|
A|----------------------------------------------------|
E|----------------------------------------------------|</span></span>

[Quinta Parte]

O dia passa
Horas se estendem
As pessoas ao redor
Nunca me entendem

O dia passa
Horas se estendem
As pessoas ao redor
Nunca me entendem

[Sexta Parte]

<span class="tablatura">[Tab - Sexta Parte]

<span class="cnt">E|-10----------------------------------------10-------|
B|-10----------13---------13/15--15\13-------10-------|
G|-10----------12b---------------------------10-------|
D|------------------------10/12--12\10----------------|
A|----------------------------------------------------|
E|----------------------------------------------------|</span></span>

         <b>Dm</b>
Tirou a roupa
 
Entrou no mar
             <b>D2</b>
Pensei: Meu Deus
                  <b>Dm</b>
Que bom que fosse
                         <b>D2</b>
Tu me apresenta essa mulher
                           <b>Dm</b>
Meu irmão, te dava até um doce
              <b>D2</b>
Sem roupa ela é demais
           <b>Dm</b>
Também por isso

Eu creio em Deus
              <b>D2</b>
Meu bom, meu Deus

Meu bom, me traz
       <b>Dm</b>
Ainda bem que eu trouxe
          <b>D2</b>
Até meu guarda-sol
 <b>Dm</b>
Tenho toda tarde
 <b>D2</b>
Tenho a vida inteira
       <b>Dm</b>                    <b>D2</b>
Já se foi aquele tempo da ladeira, irmão
           <b>Dm</b>                    <b>D2</b>
Já que se foi aquele tempo da ladeira, irmão

[Sétima Parte]

<span class="tablatura">[Tab - Sétima Parte]

Parte 1 de 2
   <b>D2</b>                          <b>C2</b>
<span class="cnt">E|---------0---------0--------------------------------|
B|-3---3-----3---------3------------3-----------------|
G|-2-------------2---------2------------0-------------|
D|-0--------------------------------------------------|
A|-0---------------------------3-3--------------------|
E|----------------------------------------------------|</span></span>

<span class="tablatura">Parte 2 de 2
   <b>D2</b>                      <b>Dm</b>         <b>D4</b>
<span class="cnt">E|-----0---------0--------------------5---------------|
B|-3-----3---------3-----------6---8----8-------------|
G|-2---------2---------2---5h7-------------7----------|
D|-0--------------------------------------------------|
A|-0--------------------------------------------------|
E|----------------------------------------------------|</span></span>

          <b>D2</b>
Meu escritório é na praia

Eu tô sempre na área

Mas eu não sou
                 <b>C2</b>
Da tua láia, não
          <b>D2</b>
Meu escritório é na praia

Eu tô sempre na área
            <b>Dm</b>
Mas eu não sou
        <b>D4</b>
Daquela    láia, não

[Refrão]

<span class="tablatura">[Tab - Riff]

Parte 1 de 4
<span class="cnt">E|----------------------------------------------------|
B|----------------------------------------------------|
G|----------------------------------------------------|
D|-----0--0--0--2-3-2-----------0--0--0--2-3-2----5---|
A|-0-3----------------3--3--0-3----------------3------|
E|----------------------------------------------------|</span></span>

<span class="tablatura">Parte 2 de 4
<span class="cnt">E|----------------------------------------------------|
B|----------------------------------------------------|
G|----------------------------------------------------|
D|-----0--0--0--2-3-2-----------0--0--0--2-3-2----5---|
A|-0-3----------------3--3--0-3----------------3------|
E|----------------------------------------------------|</span></span>

<span class="tablatura">Parte 3 de 4
<span class="cnt">E|----------------------------------------------------|
B|----------------------------------------------------|
G|----------------------------------------------------|
D|-----0--0--0--2-3-2-----------0--0--0--2-3-2----5---|
A|-0-3----------------3--3--0-3----------------3------|
E|----------------------------------------------------|</span></span>

<span class="tablatura">Parte 4 de 4
<span class="cnt">E|----------------------------------------------------|
B|----------------------------------------------------|
G|----------------------------------------------------|
D|-----0--0--0--2-3-2-----------0--0--0--2-3-2--------|
A|-0-3----------------3--3--0-3----------------3-3/5/7|
E|----------------------------------------------------|</span></span>

Então
 <b>Dm</b>           <b>D2</b>
Deixe viver, deixe ficar
 <b>Dm</b>                 <b>D2</b>
Deixe estar como está
 <b>Dm</b>           <b>D2</b> 
Deixe viver, deixe ficar
 <b>Dm</b>                 <b>D2</b>
Deixe estar como está

 <b>Dm</b>           <b>D2</b>
Deixe viver, deixe ficar
 <b>Dm</b>                 <b>D2</b>
Deixe estar como está
 <b>Dm</b>           <b>D2</b> 
Deixe viver, deixe ficar
 <b>Dm</b>                 <b>D2</b>
Deixe estar como está

[Final] <b>Dm</b>  <b>D2</b>  <b>Dm</b>  <b>D2</b>
        <b>Dm</b>  <b>D2</b>  <b>Dm</b>  <b>D2</b>

<span class="tablatura">[Tab - Final Guitarra Solo]

<span class="cnt">E|--------------17-----------13-----------------------|
B|------10-----------15------15-----------------------|
G|-10------------------------14-----------------------|
D|----------------------------------------------------|
A|----------------------------------------------------|
E|----------------------------------------------------|</span></span>

<span class="tablatura">[Tab - Final Guitarra Solo 2]

<span class="cnt">E|-10-----------10-----------12-----------------------|
B|-10-----------10-----------15-----------------------|
G|-10-----------10-----------14-----------------------|
D|----------------------------------------------------|
A|----------------------------------------------------|</span></span>
E|----------------------------------------------------|

----------------- Acordes -----------------
B2*  = X 3 5 5 3 3 - (*A#2 na forma de B2)
C#2*  = X 5 7 7 5 5 - (*C2 na forma de C#2)
C#4*  = X X 0 2 3 3 - (*C4 na forma de C#4)
C#m*  = X 5 7 7 6 5 - (*Cm na forma de C#m)`;

const [title, ...restOfCifra] = cifra.split("\n\n");
const chordsSectionIndex = restOfCifra.findIndex((line) =>
  line.includes("----------------- Acordes -----------------")
);
const mainCifra = restOfCifra.slice(0, chordsSectionIndex).join("\n\n");
const chords = restOfCifra.slice(chordsSectionIndex).join("\n\n");

export default function ZoioDeLulaPage() {
  return (
    <>
      <FramerTransitionWrapper>
        <CifraDisplay
        title={title || ""}
        mainCifra={mainCifra || ""}
        chords={chords || ""}
      />
      </FramerTransitionWrapper>
      <FloatingMenu />
    </>
  );
}
